loteriaalex/app/controllers/lotteries_controller.rb

  def checklogin
  	#nuevo = Lottery.new
  	#nuevo.user = "alex"
  	#password = 123456
  	#nuevo.password = hash_password password.to_s
  	#id = nuevo.save
  	if sesion_iniciada
  		render "index"
  		@usuario = Lottery.where(id: session[:user_id]).first
---
SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."id" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["id", 0]]