loteriaalex/app/controllers/lotteries_controller.rb

SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."id" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["id", 2]]
---
  def index
  	if not sesion_iniciada
  		@usuario = nil
  	else
  		@usuario = Lottery.where(id: session[:user_id]).first

SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."user" = $1 AND "lotteries"."password" = $2 AND "lotteries"."admin" = $3  ORDER BY "lotteries"."id" ASC LIMIT 1  [["user", "alex"], ["password", "e10adc3949ba59abbe56e057f20f883e"], ["admin", "f"]]
---
  def checklogin
  	#nuevo = Lottery.new
  	#nuevo.user = "alex2"
  	#password = 123456
  	#nuevo.password = hash_password password.to_s
  	#nuevo.save
  	params.require(:user)
  	params.require(:password)

  	usuario =params[:user]
  	password =hash_password(params[:password])

  	@usuario = Lottery.where(user: usuario, password: password, admin: false).first

SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."user" = $1 AND "lotteries"."password" = $2 AND "lotteries"."admin" = $3  ORDER BY "lotteries"."id" ASC LIMIT 1  [["user", "alex"], ["password", "e10adc3949ba59abbe56e057f20f883e"], ["admin", "t"]]
---
  def checkadmin
  	if comprobar_sesiones
  		return
  	end

  	params.require(:user)
  	params.require(:password)

  	usuario =params[:user]
	password =hash_password(params[:password])

	@admin = Lottery.where(user: usuario, password: password, admin: true).first

INSERT INTO "lotteries" ("user", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user", "katafira"], ["password", "0ea9a067fe18cd3065edcd38f2c05c75"], ["created_at", "2016-03-21 13:07:49.230432"], ["updated_at", "2016-03-21 13:07:49.230432"]]
---
 def checksignup
 	mensaje = "No puede crear una cuenta con una sesión abierta"
 	if comprobar_sesiones(mensaje1=mensaje, mensaje2=mensaje)
  		return
  	end

  	params.require(:user)
  	params.require(:password)
  	params.require(:password_repeat)

  	if params[:password]==params[:password_repeat]
  		usuario = params[:user]
  		pass = hash_password params[:password].to_s
	  	n = Lottery.new
	  	n.user = usuario
    	n.password = pass
    	n.save!

SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."id" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."admin" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["admin", "true"]]
---
 def numero
  if sesion_iniciada
    @vista = "usuario"
    @usuario = Lottery.where(id: session[:user_id]).first
    admin = Lottery.where(admin: :true).first

SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."id" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["id", 0]]
UPDATE "lotteries" SET "numero" = $1, "updated_at" = $2 WHERE "lotteries"."id" = $3  [["numero", 9999], ["updated_at", "2016-03-22 09:50:30.196188"], ["id", 3]]
SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."admin" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["admin", "true"]]
---
 def savenumero
  if sesion_iniciada
    params.require(:numero)
    num = numero_o_nulo(params[:numero])
    if num.nil?
      flash[:notice] = "No es número"
      redirect_to action: :numero
      return
    else
      @usuario = Lottery.where(id: session[:user_id]).first
      @usuario.update(numero: num)
      flash[:notice] = "Su número de Lotería ha sido guardado correctamente"
      redirect_to action: :numero
      return
    end
  elsif sesion_admin_iniciada
    params.require(:numero)
    num = numero_o_nulo(params[:numero])
    if num.nil?
      flash[:notice] = "No es número"
      redirect_to action: :numero
      return
    else
      @admin = Lottery.where(id: session[:admin_id]).first

SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."id" = $1  ORDER BY "lotteries"."id" ASC LIMIT 1  [["id", 3]]
---
def cambiar
  if sesion_admin_iniciada
    flash[:notice] = "No puede acceder"
    redirect_to action: :index
    return
  elsif sesion_iniciada
    @usuario = Lottery.where(id: session[:user_id]).first

UPDATE "lotteries" SET "numero" = NULL
---
def reiniciar_loteria
  Lottery.update_all(numero: nil)